import React from 'react';
import './Info.css';

const Info = () => {
    return (
        <div className='info'>
            <h1>Информация про философию JazzTeam Software Development Company</h1>
            <h3 dir="ltr"><span style={{ color: '#2550d9;' }}>Киты, на которых стоит наша философия</span></h3>
            <p><strong>Результат</strong></p>
            <p dir="ltr">Мерило вашего трудового дня. Должен быть. Думаем о конкретике. Пробуем точно понять, что ожидается от вас в таске, и чётко представлять условия, критерии завершения работы над таском.</p>
            <p dir="ltr"> <strong>Engineering (Инженерия)</strong></p>
            <p dir="ltr">Programming is an engineering. Not just coding. Engineering is a serious process where maturity plays main role. (Программирование – это инженерная наука. Не просто кодирование. Инженерия – серьёзный процесс, где зрелость и серьёзность играют важнейшую роль).</p>
            <p><strong>Реалистичность</strong></p>
            <p dir="ltr">Наиболее важна – показывает, правильно ли мы понимаем реальность. В сроках, в оценках, в ожиданиях. Реалистичность тесно связана с работой на результат. Иногда наше ложное эго мешает нам смотреть реально на вещи, иногда наши страхи мешают понять, что именно от тебя требует руководитель.</p>
            <p><strong>Инновации</strong></p>
            <p dir="ltr">Как гарант отсутствия старпёрства и нежелания развиваться дальше. Как гарант увеличения добавленной стоимости команды. Как мерило уровня творчества команды.</p>
            <p><strong>Развитие мышления</strong></p>
            <p dir="ltr">Не делать машинально, но понимать, что делаешь. Понимать, чем что вызвано. Ясно, чисто, позитивно осознавать задание, проект. Вы – не чародеи, вы – инженеры. Никогда не стоит видеть чёрные тучи на проекте, никогда не стоит бояться. Стоит делать всё возможное, чтобы мышление на проекте было светлое.</p>
            <p><strong>Самостоятельность</strong></p>
            <p dir="ltr">Как показатель умения поставить себя на место другого человека, задать вопросы, которые нужно задать. Как показатель желания двигать проект в нужную сторону. Как показатель уважения к своим коллегам, которым не нужно напоминать вам детские вещи.</p>
            <p><strong>Команда</strong></p>
            <p dir="ltr">Только со слаженной командой можно разрабатывать классные, сложные, высоко-технологические, интересные программные системы. Проект даётся не человеку, но команде. В конечном итоге, проблемы каждого становятся проблемами команды. Командная работа – это и дружелюбие, и сострадание, и взаимоуважение, и сплоченность, подстраховка.</p>
            <p><strong>Трудолюбие</strong></p>
            <p dir="ltr">Ра-Ботать (говорить с Богом), а не Раб-Отать. Позитивное отношение к труду, к своим обязанностям. В конечном итоге – любая деятельность с позитивным отношением приносит кому-то пользу. В нашем случае – нашим заказчикам.</p>
            <p><strong>Саморазвитие</strong></p>
            <p dir="ltr">Развиваешься в жизни – развиваешься и как профессионал. И наоборот! Черты характера в жизни полностью переходят на черты характера в программировании. Развивайтесь. Не стремитесь всего достичь сразу. Делайте главный свой фокус саморазвитием. Думайте о долгосрочной перспективе.</p>
            <p><strong>Ответственность</strong></p>
            <p dir="ltr">Перед собой. Перед заказчиком. Перед командой. Мерило осознанности и понимания, зачем всё это делается.</p>
            <p><strong>Архитектура</strong></p>
            <p dir="ltr">Создается перед программированием. Очень важное инвестирование. Как фундамент вашего дома. Мы всегда знаем, почему применили данное решение, можем рационально это объяснить. Можем объяснить в стиле “для тупых”, можем объяснить очень сложное просто.</p>
            <p><strong>Искренность</strong></p>
            <p dir="ltr">Нам нечего бояться. Мы верим, что искренность помогает человеку быть полноценным, неэгоистичным, бесстрашным, более счастливым.</p>
            <p><strong>Уважение</strong></p>
            <p dir="ltr">Как показатель зрелости члена команды. Зрелость – это возможность следовать не только своим интересам, но и интересам других людей, любить и уважать не только себя, но и своих коллег.</p>
            <p><strong>Неформальность</strong></p>
            <p dir="ltr">Как показатель уважения, отсутствия очковтирательства и чародейства в программировании. Это сложно – быть неформальным в общении, но серьёзным в отношении к своим обязанностям на проекте.</p>
            <p dir="ltr"><strong>Интенсивность</strong></p>
            <p dir="ltr">А не экстенсивность. Качество и инновационность в программной индустрии помогает выиграть в количестве. Прямое отношение к архитектуре.</p>
            <p><strong>Креативность</strong></p>
            <p dir="ltr">С мыслями о реалистичности. Голая креативность губит лучшие начинания, в то время в связке с рациональностью и прагматизмом помогает достичь цели.</p>
            <p><strong>R&D</strong></p>
            <p dir="ltr">Research & Development – инвестиции в изучение, обучение, инновации, исследования, будущее.</p>
            <p><strong>Живой интерес</strong></p>
            <p dir="ltr">Жить, работать, обучаться, программировать так, чтобы было интересно это делать, было интересно этим жить.</p>
            <p><strong>Jazz Funk Swing</strong></p>
            <p dir="ltr">Весело, радостно, с огоньком.</p>
            <p><strong>Мобильность</strong></p>
            <p dir="ltr">Как отражение современного мира. Мобильность команды, места разработки, средств разработки. Отражением Funk-а и Agile.</p>
            <p><strong>English: talk & write</strong></p>
            <p dir="ltr">Фокус на англоязычном мире.</p>
            <p><strong>Обучение: study & teach</strong></p>
            <p dir="ltr">Передача опыта другим людям. Получение опыта других людей. Инвестиция в будущее. Развитие навыков общения и эффективной передачи знаний и опыта.</p>
        </div>
    );
}

export default React.memo(Info);